Tekla Open API Reference for Tekla Structures 2025
NumberingSeriesNullable Constructor (String, Int32)
 Initializes a new instance of the NumberingSeriesNullable class with the given arguments.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public NumberingSeriesNullable(
	string prefix,
	int number
)
Public Sub New (
	prefix As String,
	number As Integer
)
Parameters
prefix
Type: System.String
The prefix to be used.
number
Type: System.Int32
The start number to be used.
See Also
Reference
NumberingSeriesNullable Class
NumberingSeriesNullable Overload
Tekla.Structures.Model Namespace